/* errAuthorizationInvalidSet */
"-60001" = "Los derechos de autorización no son válidos.";

/* errAuthorizationInvalidRef */
"-60002" = "La referencia de autorización no es válida.";

/* errAuthorizationInvalidTag */
"-60003" = "La etiqueta de autorización no es válida.";

/* errAuthorizationInvalidPointer */
"-60004" = "La autorización devuelta no es válida.";

/* errAuthorizationDenied */
"-60005" = "Se ha denegado la autorización.";

/* errAuthorizationCanceled */
"-60006" = "La autorización ha sido anulada por el usuario.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Se ha denegado la autorización porque no era posible la interacción con el usuario.";

/* errAuthorizationInternal */
"-60008" = "No se ha podido obtener autorización para esta operación.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "No se permite convertir la autorización a un formato externo.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "No se permite crear la autorización desde un formato externo.";

/* errAuthorizationInvalidFlags */
"-60011" = "Los indicadores de opciones proporcionados no son válidos para esta operación de autorización.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "El programa especificado no se ha podido ejecutar.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Se ha devuelto un mensaje de estado no válido durante la ejecución de una herramienta privilegiada.";

/* errAuthorizationBadAddress */
"-60033" = "La dirección del conector solicitada no es válida (debe estar en 0-1023, estos incluidos).";

/* errSSLProtocol */
"-9800" = "Error de protocolo SSL";

/* errSSLNegotiation */
"-9801" = "Error de negociación de Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Aviso grave";

/* errSSLWouldBlock */
"-9803" = "La E/S se bloqueará (no es grave)";

/* errSSLSessionNotFound */
"-9804" = "se ha intentado restaurar una sesión desconocida";

/* errSSLClosedGraceful */
"-9805" = "la conexión se ha cerrado correctamente";

/* errSSLClosedAbort */
"-9806" = "la conexión se ha cerrado con un error";

/* errSSLXCertChainInvalid */
"-9807" = "cadena de certificados no válida";

/* errSSLBadCert */
"-9808" = "formato de certificado no válido";

/* errSSLCrypto */
"-9809" = "error criptográfico subyacente";

/* errSSLInternal */
"-9810" = "Error interno";

/* errSSLModuleAttach */
"-9811" = "error de conexión de módulo";

/* errSSLUnknownRootCert */
"-9812" = "cadena de certificados válida, raíz no fiable";

/* errSSLNoRootCert */
"-9813" = "cadena de certificados no verificada por la raíz";

/* errSSLCertExpired */
"-9814" = "la cadena incluye un certificado caducado";

/* errSSLCertNotYetValid */
"-9815" = "la cadena incluye un certificado que aún no es válido";

/* errSSLClosedNoNotify */
"-9816" = "el servidor cerró la sesión sin ninguna notificación";

/* errSSLBufferOverflow */
"-9817" = "no se ha proporcionado memoria intermedia suficiente";

/* errSSLBadCipherSuite */
"-9818" = "SSLCipherSuite incorrecto";

/* errSSLPeerUnexpectedMsg */
"-9819" = "se ha recibido un mensaje inesperado";

/* errSSLPeerBadRecordMac */
"-9820" = "MAC erróneo";

/* errSSLPeerDecryptionFail */
"-9821" = "error de descifrado";

/* errSSLPeerRecordOverflow */
"-9822" = "exceso de registros";

/* errSSLPeerDecompressFail */
"-9823" = "error de descompresión";

/* errSSLPeerHandshakeFail */
"-9824" = "error de enlace";

/* errSSLPeerBadCert */
"-9825" = "certificado no válido misc.";

/* errSSLPeerUnsupportedCert */
"-9826" = "formato de certificado incompatible incorrecto";

/* errSSLPeerCertRevoked */
"-9827" = "certificado revocado";

/* errSSLPeerCertExpired */
"-9828" = "certificado caducado";

/* errSSLPeerCertUnknown */
"-9829" = "certificado desconocido";

/* errSSLIllegalParam */
"-9830" = "parámetro no válido";

/* errSSLPeerUnknownCA */
"-9831" = "autoridad de certificación desconocida";

/* errSSLPeerAccessDenied */
"-9832" = "acceso denegado";

/* errSSLPeerDecodeError */
"-9833" = "error de descodificación";

/* errSSLPeerDecryptError */
"-9834" = "error de descifrado";

/* errSSLPeerExportRestriction */
"-9835" = "restricción a la exportación";

/* errSSLPeerProtocolVersion */
"-9836" = "versión de protocolo incorrecta";

/* errSSLPeerInsufficientSecurity */
"-9837" = "seguridad insuficiente";

/* errSSLPeerInternalError */
"-9838" = "error interno";

/* errSSLPeerUserCancelled */
"-9839" = "cancelado por el usuario";

/* errSSLPeerNoRenegotiation */
"-9840" = "renegociación no autorizada";

/* errSSLServerAuthCompleted */
"-9841" = "el certificado del servidor es válido o, si la verificación está desactivada, se ha ignorado";

/* errSSLClientCertRequested */
"-9842" = "el servidor ha solicitado un certificado de cliente";

/* errSSLHostNameMismatch */
"-9843" = "diferencia de nombres de servidor";

/* errSSLConnectionRefused */
"-9844" = "conexión interrumpida antes de recibir respuesta";

/* errSSLDecryptionFail */
"-9845" = "error de descifrado";

/* errSSLBadRecordMac */
"-9846" = "MAC erróneo";

/* errSSLRecordOverflow */
"-9847" = "exceso de registros";

/* errSSLBadConfiguration */
"-9848" = "error de configuración";

/* errSecSuccess */
"0" = "Ningún error.";

/* errSecUnimplemented */
"-4" = "Función u operación no implementada.";

/* errSecParam */
"-50" = "Uno o más parámetros transmitidos a una función no son válidos.";

/* errSecAllocate */
"-108" = "Error en la asignación de memoria.";

/* errSecNotAvailable */
"-25291" = "No hay ningún llavero disponible. Deberá reiniciar el ordenador.";

/* errSecReadOnly */
"-25292" = "Este llavero no puede modificarse.";

/* errSecAuthFailed */
"-25293" = "El nombre de usuario o la contraseña que ha introducido no son correctos.";

/* errSecNoSuchKeychain */
"-25294" = "No se ha podido encontrar el llavero especificado.";

/* errSecInvalidKeychain */
"-25295" = "El llavero especificado no es un archivo de llavero válido.";

/* errSecDuplicateKeychain */
"-25296" = "Ya existe un llavero con el mismo nombre.";

/* errSecDuplicateCallback */
"-25297" = "La función de devolución de llamada especificada ya está instalada.";

/* errSecInvalidCallback */
"-25298" = "La función de devolución de llamada especificada no es válida.";

/* errSecDuplicateItem */
"-25299" = "El ítem especificado ya existe en este llavero.";

/* errSecItemNotFound */
"-25300" = "No se ha podido encontrar el ítem especificado en el llavero.";

/* errSecBufferTooSmall */
"-25301" = "No hay suficiente memoria disponible para usar el ítem especificado.";

/* errSecDataTooLarge */
"-25302" = "La información que contiene este ítem es demasiado grande o tiene un formato que no puede visualizarse.";

/* errSecNoSuchAttr */
"-25303" = "El atributo especificado no existe.";

/* errSecInvalidItemRef */
"-25304" = "El ítem especificado ya no es válido. Puede que se haya eliminado del llavero.";

/* errSecInvalidSearchRef */
"-25305" = "No se ha podido buscar en el llavero actual.";

/* errSecNoSuchClass */
"-25306" = "El ítem especificado no es un ítem de llavero válido.";

/* errSecNoDefaultKeychain */
"-25307" = "No se ha podido encontrar un llavero por omisión.";

/* errSecInteractionNotAllowed */
"-25308" = "No se permite la interacción con el usuario.";

/* errSecReadOnlyAttr */
"-25309" = "El atributo especificado no se ha podido modificar.";

/* errSecWrongSecVersion */
"-25310" = "Este llavero no puede abrirse porque se ha creado con una versión distinta del software del sistema.";

/* errSecKeySizeNotAllowed */
"-25311" = "Este ítem determina un tamaño de clave demasiado grande.";

/* errSecNoStorageModule */
"-25312" = "No se ha podido cargar un componente necesario (módulo de almacenamiento de datos). Deberá reiniciar el ordenador.";

/* errSecNoCertificateModule */
"-25313" = "No se ha podido cargar un componente necesario (módulo de certificados). Deberá reiniciar el ordenador.";

/* errSecNoPolicyModule */
"-25314" = "No se ha podido cargar un componente necesario (módulo de políticas). Deberá reiniciar el ordenador.";

/* errSecInteractionRequired */
"-25315" = "Se requiere la interacción con el usuario, pero actualmente no está permitida.";

/* errSecDataNotAvailable */
"-25316" = "No se puede recuperar el contenido de este ítem.";

/* errSecDataNotModifiable */
"-25317" = "No puede modificarse el contenido de este ítem.";

/* errSecCreateChainFailed */
"-25318" = "No pueden encontrarse uno o varios certificados necesarios para validar este certificado.";

/* errSecInvalidPrefsDomain */
"-25319" = "El dominio de preferencias especificado no es válido.";

/* errSecACLNotSimple */
"-25240" = "La lista de control de acceso especificada no tiene el formato estándar (simple).";

/* errSecPolicyNotFound */
"-25241" = "No se encuentra la política especificada.";

/* errSecInvalidTrustSetting */
"-25242" = "El ajuste de confianza especificado no es válido.";

/* errSecNoAccessForItem */
"-25243" = "El elemento especificado no tiene control de acceso.";

/* errSecInvalidOwnerEdit */
"-25244" = "Ha habido un intento no válido de cambiar el propietario de este elemento.";

/* errSecTrustNotAvailable */
"-25245" = "No hay resultados de confianza disponibles.";

/* errSecUnsupportedFormat */
"-25256" = "Formato de importación/exportación no admitido.";

/* errSecUnknownFormat */
"-25257" = "Formato de importación desconocido.";

/* errSecKeyIsSensitive */
"-25258" = "El material de las claves debe protegerse para la exportación.";

/* errSecMultiplePrivKeys */
"-25259" = "Se han intentado importar varias claves privadas.";

/* errSecPassphraseRequired */
"-25260" = "La importación/exportación requiere una contraseña.";

/* errSecInvalidPasswordRef */
"-25261" = "La referencia de la contraseña no era válida.";

/* errSecInvalidTrustSettings */
"-25262" = "El registro de ajustes de confianza estaba dañado.";

/* errSecNoTrustSettings */
"-25263" = "No se han encontrado los ajustes de confianza.";

/* errSecPkcs12VerifyFailure */
"-25264" = "Error de verificación MAC durante la importación PKCS12.";

/* errSecDecode */
"-26275" = "Imposible descodificar los datos proporcionados.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Vector CSP de valores de error de búfers.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Valores de error de contexto criptográficos CSP.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Valores de error API criptográficos CSP.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Se ha intentado usar una clave pública que no estaba completa debido a * la falta de parámetros específicos del algoritmo.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "error de una correspondencia de firma de códigos";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Clave StartDate/EndDate no válida";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Códigos de error de sincronización de llaveros";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "comprobación de relleno SSLv2: ataque de rollback detectado";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "El argumento OpenParameters transferido a CSSM_DL_DbCreate o CSSM_DL_DbOpen no era ni NULL ni un puntero hacia una estructura CSSM_APPLEDL_OPEN_PARAMETERS válida.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "se ha producido un error en una operación porque el disco estaba lleno";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "se ha producido un error en la operación porque se ha superado la capacidad de disco";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "se ha producido un error en una operación porque un archivo era demasiado grande";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "la información interna de una base de datos de llaveros (“blob”) no es válida";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "la versión del formato de los datos internos para la información interna de una base de datos (“blob”) no es válida";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Error en el nombre del servidor";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Extensión no reconocida con el indicador grave verdadero";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Extensión de restricciones básicas necesaria por política, pero no presente";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "CA con restricciones básicas no válidas";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "ID de clave de la autoridad no válido";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "ID de clave del sujeto no válido";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Uso de clave ampliado no válido para la política";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Uso de clave ampliado no válido para la política";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Enlace de ID de la clave del sujeto/autoridad no válido";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "Se ha superado la restricción de longitud de la ruta";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Grupo de certificados terminado en un certificado raíz que no se autoverificó";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL caducada/no válida aún";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "No se encuentra la CRL adecuada";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "el servidor CRL especificado no está disponible";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL de punto de distribución CRL no válida";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Extensión de certificado/CRL grave desconocida";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL no verificable en el certificado ancla o raíz";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verificada en un certificado raíz no fiable";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "La CRL no ha pasado la verificación de la política";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Violación de la extensión del punto de distribución de emisión";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Certificado no encontrado en el nombre alternativo del emisor";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Certificado no válido obtenido de un nombre alternativo del emisor";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME: error en la dirección de correo";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "No se ha encontrado el uso de clave ampliado S/MIME adecuado";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME: incompatibilidad del uso de la clave";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME: certificado con el uso de clave marcado como grave";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, hoja con el nombre del asunto vacío y sin direcciones de correo * en SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, hoja con el nombre del asunto vacío, SubjectAltName * no grave";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "No se ha encontrado el uso de clave ampliada SSL adecuado";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "respuesta OCSP no analizable";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "petición OCSP no analizable";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "servicio OCSP no disponible";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "estado OCSP: certificado no reconocido";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "error de comprobación de revocación en cada certificado";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "error de red general";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "respuesta OCSP no verificable en el certificado ancla o raíz";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "respuesta OCSP verificada en un certificado raíz no fiable";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "error de firma de respuesta OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "No se ha encontrado firmante para la respuesta OCSP";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "estado del respondedor OCSP: petición mal formada";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "estado del respondedor OCSP: error interno";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "estado del respondedor OCSP: intentar más tarde";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "estado del respondedor OCSP: firma necesaria";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "estado del respondedor OCSP: no autorizado";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "la respuesta OCSP no coincide con la petición";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Longitud de cadenas de certificados no válida para la firma de códigos";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Faltan restricciones básicas para la firma de códigos";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint incorrecto para la firma de códigos";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Falta ExtendedKeyUsage para la firma de códigos";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Certificado de firma de códigos de estilo de desarrollo detectado";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Longitud de cadena de certificados no válida para la firma de recursos";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "uso de clave ampliado erróneo para la firma de recursos";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Ajuste de confianza: denegar";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "SubjectName vacío no válido";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ID de declaración de certificado cualificado grave desconocido";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "petición de certificado en cola";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "petición de certificado redirigida";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "error general de comunicación del servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "error de parámetros de comunicación del servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "error de autorización de comunicación del servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "comunicación del servidor no implementada";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "comunicación del servidor no disponible";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "ya existe comunicación del servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "error del servicio de comunicación del servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "petición pendiente para el usuario especificado";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "no hay ninguna petición pendiente para el usuario especificado";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "no se ha podido comprobar la CSR";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "el servidor ha comunicado un error de la comprobación de coherencia";

/* errSecCSUnimplemented */
"-67072" = "función de firma de códigos no implementada";

/* errSecCSInvalidObjectRef */
"-67071" = "referencia del objeto API no válida";

/* errSecCSInvalidFlags */
"-67070" = "indicadores especificados no válidos o inapropiados";

/* errSecCSObjectRequired */
"-67069" = "un argumento de puntero necesario era NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "no se puede encontrar el objeto del código en el disco";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "no se pueden localizar los invitados que usan este conjunto de atributos";

/* errSecCSInvalidAttributeValues */
"-67066" = "los valores de atributo facilitados no son válidos";

/* errSecCSNoSuchCode */
"-67065" = "el servidor no tiene ningún invitado con los atributos solicitados";

/* errSecCSMultipleGuests */
"-67064" = "el servidor tiene varios invitados con este valor de atributo";

/* errSecCSGuestInvalid */
"-67063" = "la identidad del código se ha invalidado";

/* errSecCSUnsigned */
"-67062" = "el objeto del código no está firmado";

/* errSecCSSignatureFailed */
"-67061" = "código o firma modificado/a";

/* errSecCSSignatureNotVerifiable */
"-67060" = "la firma no puede leerse debido a, por ejemplo, un sistema de archivos que asigna la raíz a un usuario sin privilegios";

/* errSecCSSignatureUnsupported */
"-67059" = "tipo o versión de la firma incompatible";

/* errSecCSBadDictionaryFormat */
"-67058" = "un archivo plist o un recurso necesario está mal formado";

/* errSecCSResourcesNotSealed */
"-67057" = "los recursos no están sellados por la firma";

/* errSecCSResourcesNotFound */
"-67056" = "no se pueden encontrar los recursos sellados en el código";

/* errSecCSResourcesInvalid */
"-67055" = "el directorio de recursos sellados no es válido";

/* errSecCSBadResource */
"-67054" = "un recurso sellado ha desaparecido o no es válido";

/* errSecCSResourceRulesInvalid */
"-67053" = "regla(s) de selección de recursos no válida(s)";

/* errSecCSReqInvalid */
"-67052" = "requisitos de código no válidos o dañados";

/* errSecCSReqUnsupported */
"-67051" = "tipo o versión de los requisitos de código incompatible";

/* errSecCSReqFailed */
"-67050" = "no se han podido cumplir los requisitos de código";

/* errSecCSBadObjectFormat */
"-67049" = "formato de archivo del objeto no válido o inadecuado";

/* errSecCSInternalError */
"-67048" = "error interno en el subsistema de firma de códigos";

/* errSecCSHostReject */
"-67047" = "el código ha rechazado su servidor";

/* errSecCSNotAHost */
"-67046" = "este código no es un servidor";

/* errSecCSSignatureInvalid */
"-67045" = "formato no válido para la firma";

/* errSecCSHostProtocolRelativePath */
"-67044" = "violación de protocolo del servidor - ruta absoluta del invitado requerida";

/* errSecCSHostProtocolContradiction */
"-67043" = "violación de protocolo del servidor - modos del servidor contradictorios";

/* errSecCSHostProtocolDedicationError */
"-67042" = "violación de protocolo del servidor - operación no permitida con/para un invitado dedicado";

/* errSecCSHostProtocolNotProxy */
"-67041" = "violación de protocolo del servidor - servidor proxy no activado";

/* errSecCSHostProtocolStateError */
"-67040" = "violación de protocolo del servidor - petición de cambio de estado del invitado no válida";

/* errSecCSHostProtocolUnrelated */
"-67039" = "violación de protocolo del servidor - el invitado dado no es un invitado del servidor dado";

/* errSecCSInvalidOperation */
"-67038" = "la operación solicitada no es válida";

/* errSecCSNotSupported */
"-67037" = "operación no admitida para este tipo de código";

/* errSecCSCMSTooLarge */
"-67036" = "firma demasiado larga para insertarla";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "violación de protocolo del servidor - hash del invitado no válido";

/* errSecCSStaticCodeChanged */
"-67034" = "el programa del disco no coincide con el que se está ejecutando";

/* errSecCSSigDBDenied */
"-67033" = "acceso a la base de datos de firmas denegado";

/* errSecCSSigDBAccess */
"-67032" = "no se puede acceder a la base de datos de firmas";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "el servidor ha devuelto atributos de invitado incoherentes o no válidos";

/* errSecMisc_dskFulErr */
"-34" = "El disco está lleno.";

/* errSecMisc_nsvErr */
"-35" = "No se ha podido encontrar el disco. Puede que se haya expulsado.";

/* errSecMisc_bdNamErr */
"-37" = "Se ha intentado abrir un archivo cuyo nombre contiene un carácter no válido.";

/* errSecMisc_fnfErr */
"-43" = "No se ha podido encontrar el archivo.";

/* errSecMisc_wPrErr */
"-44" = "El disco está protegido contra escritura.";

/* errSecMisc_fLckdErr */
"-45" = "El archivo está bloqueado.";

/* errSecMisc_vLckdErr */
"-46" = "El volumen está bloqueado.";

/* errSecMisc_fBsyErr */
"-47" = "El archivo no está disponible. Puede que esté siendo usado por otra aplicación.";

/* errSecMisc_dupFNErr */
"-48" = "Ya existe un archivo con el mismo nombre.";

/* errSecMisc_opWrErr */
"-49" = "El archivo ya está abierto con permisos de escritura.";

/* errSecMisc_volOffLinErr */
"-53" = "Este volumen ya no está disponible. Puede que se haya expulsado.";

/* errSecMisc_permErr */
"-54" = "No ha podido abrirse el archivo. Puede que esté siendo usado por otra aplicación.";

/* errSecMisc_extFSErr */
"-58" = "Parece que este volumen no es compatible.";

/* errSecMisc_wrPermErr */
"-61" = "No se ha podido escribir en el archivo. Puede que se haya abierto con privilegios de acceso insuficientes.";

/* errSecMisc_offLinErr */
"-65" = "Este dispositivo de almacenamiento ya no está disponible. Puede que se haya expulsado.";

/* errSecMisc_dirNFErr */
"-120" = "No se ha podido encontrar el directorio.";

/* errSecMisc_volGoneErr */
"-124" = "Este volumen del servidor ya no está disponible. Puede que se haya desconectado.";

/* errSecMisc_userCanceledErr */
"-128" = "El usuario ha cancelado la operación.";

/* errSecMisc_resNotFound */
"-192" = "No se ha encontrado un recurso necesario.";

/* errSecMisc_resFNotFound */
"-193" = "Un recurso necesario ha desaparecido o está dañado.";

/* errSecMisc_icNoURLErr */
"-673" = "La dirección URL especificada tiene un formato desconocido o no contiene suficiente información.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "No se ha podido encontrar una aplicación de ayuda para abrir la URL especificada.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "La dirección URL de este elemento ha desaparecido o no tiene el formato adecuado.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Se ha denegado el acceso a este ítem.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Error de autenticación. Es posible que la contraseña de este servidor haya cambiado desde que este ítem se añadió al llavero.";

